Infineon/mtb-example-psoc4-msclp-capsense-lp-proximity/main.c
                /* Scan, process and check the status of the all Active mode sensors */
                if(Cy_CapSense_IsAnyWidgetActive(&cy_capsense_context))
                {
                    appStateTimeoutCount = TIMEOUT_RESET;
                }
                else
                {
                    appStateTimeoutCount++;

                    if(ACTIVE_MODE_TIMEOUT < appStateTimeoutCount)
                    {
                        appState = ALR_MODE;
                        appStateTimeoutCount = TIMEOUT_RESET;

                        /* Configure the MSCLP wake up timer as per the ALR mode refresh rate */
                        Cy_CapSense_ConfigureMsclpTimer(ALR_MODE_TIMER, &cy_capsense_context);
                    }
                }

#if ENABLE_RUN_TIME_MEASUREMENT
                activeModeRunTime = StopRuntimeMeasurement();
#endif
                break;
                /* End of ACTIVE_MODE */

            /* Active Low Refresh-rate Mode */
            case ALR_MODE :

                Cy_CapSense_ScanAllSlots(&cy_capsense_context);
                
                interruptStatus = Cy_SysLib_EnterCriticalSection();

                while (Cy_CapSense_IsBusy(&cy_capsense_context))
                {
                    Cy_SysPm_CpuEnterDeepSleep();

                    Cy_SysLib_ExitCriticalSection(interruptStatus);
                    interruptStatus = Cy_SysLib_EnterCriticalSection();
                }
                Cy_SysLib_ExitCriticalSection(interruptStatus);

#if ENABLE_RUN_TIME_MEASUREMENT
                alrModeRunTime = 0u;
                StartRuntimeMeasurement();
#endif

                Cy_CapSense_ProcessAllWidgets(&cy_capsense_context);

                /* Scan, process and check the status of the all Active mode sensors */
                if(Cy_CapSense_IsAnyWidgetActive(&cy_capsense_context))
                {
                    appState = ACTIVE_MODE;
                    appStateTimeoutCount = TIMEOUT_RESET;

                    /* Configure the MSCLP wake up timer as per the ACTIVE mode refresh rate */
                    Cy_CapSense_ConfigureMsclpTimer(ACTIVE_MODE_TIMER, &cy_capsense_context);
                }
                else
                {
                    appStateTimeoutCount++;

                    if(ALR_MODE_TIMEOUT < appStateTimeoutCount)
                    {
                        appState = WOT_MODE;
                        appStateTimeoutCount = TIMEOUT_RESET;
                    }
                }

#if ENABLE_RUN_TIME_MEASUREMENT
                alrModeRunTime = StopRuntimeMeasurement();
#endif
                break;
                /* End of Active-Low Refresh Rate(ALR) mode */

            /* Wake On Touch Mode */
            case WOT_MODE :

                /* Trigger the low power widget scan */
                Cy_CapSense_ScanAllLpSlots(&cy_capsense_context);

                while (Cy_CapSense_IsBusy(&cy_capsense_context))
                {
                    /* Enter and stay in Deep Sleep until WOT timeout or a touch is detected. */
                    /* WOT Timeout = WOT scan interval x Num of frames in WOT (in uSec); 
                    * Refer to Wake-On-Touch settings in CAPSENSE Configurator for WOT Timeout*/

                    Cy_SysPm_CpuEnterDeepSleep ();
                }

                /* Process only the Low Power widgets to detect touch */
                Cy_CapSense_ProcessWidget(CY_CAPSENSE_LOWPOWER0_WDGT_ID, &cy_capsense_context);

                if (Cy_CapSense_IsAnyLpWidgetActive(&cy_capsense_context))
                {
                    appState = ACTIVE_MODE;
                    appStateTimeoutCount = TIMEOUT_RESET;

                    /* Configure the MSCLP wake up timer as per the ACTIVE mode refresh rate */
                    Cy_CapSense_ConfigureMsclpTimer(ACTIVE_MODE_TIMER, &cy_capsense_context);
                }

                else
                {
                    appState = ALR_MODE;
                    appStateTimeoutCount = TIMEOUT_RESET;

                    /* Configure the MSCLP wake up timer as per the ALR mode refresh rate */
                    Cy_CapSense_ConfigureMsclpTimer(ALR_MODE_TIMER, &cy_capsense_context);
                }
                break;
                /* End of "WAKE_ON_TOUCH_MODE" */

            default:
                /** Unknown power mode state. Unexpected situation. **/
                CY_ASSERT(CY_ASSERT_FAILED);
                break;
        }

#if ENABLE_SPI_SERIAL_LED
        /* Refresh LEDs to show latest status */
        UpdateLeds();
#endif

#if ENABLE_TUNER
        /* Establishes synchronized communication with the CAPSENSE&trade; Tuner tool */
        Cy_CapSense_RunTuner(&cy_capsense_context);
#endif

    }
}

/*******************************************************************************
* Function Name: InitializeCapsense
********************************************************************************
* Summary:
*  This function initializes the CAPSENSE and configures the CAPSENSE
*  interrupt.
*
*******************************************************************************/
static void InitializeCapsense(void)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;

    /* CAPSENSE interrupt configuration MSC 0 */
    const cy_stc_sysint_t msc0InterruptConfig =
    {
        .intrSrc = CY_MSCLP0_LP_IRQ,
        .intrPriority = CAPSENSE_MSC0_INTR_PRIORITY,
    };

    /* Capture the MSC HW block and initialize it to the default state. */
    status = Cy_CapSense_Init(&cy_capsense_context);

    if (CY_CAPSENSE_STATUS_SUCCESS == status)
    {
        /* Initialize CAPSENSE interrupt for MSC 0 */
        Cy_SysInt_Init(&msc0InterruptConfig, Capsense_Msc0Isr);
        NVIC_ClearPendingIRQ(msc0InterruptConfig.intrSrc);
        NVIC_EnableIRQ(msc0InterruptConfig.intrSrc);

        /* Initialize the CAPSENSE firmware modules. */
        status = Cy_CapSense_Enable(&cy_capsense_context);
    }

    if (status != CY_CAPSENSE_STATUS_SUCCESS)
    {
        /* This status could fail before tuning the sensors correctly.
         * Ensure that this function passes after the CAPSENSE sensors are tuned
         * as per procedure give in the Readme.md file */
    }
}

