Infineon/mtb-example-psoc4-msclp-capsense-lp-proximity/main.c
    /* For BIST configuration Connecting all Inactive sensor connections (ISC) of Shield sensors to to Shield*/
    Cy_CapSense_SetInactiveElectrodeState(CY_CAPSENSE_SNS_CONNECTION_SHIELD,
    CY_CAPSENSE_BIST_SHIELD_GROUP, &cy_capsense_context);

    /*Runs the BIST to measure the Shield capacitance*/
    Cy_CapSense_RunSelfTest(CY_CAPSENSE_BIST_SHIELD_CAP_MASK,
            &cy_capsense_context);

}
#endif

#if ENABLE_RUN_TIME_MEASUREMENT
/*******************************************************************************
* Function Name: StartRuntimeMeasurement
********************************************************************************
* Summary:
*  Initializes the system tick counter by calling Cy_SysTick_Clear() API.
*******************************************************************************/
static void StartRuntimeMeasurement()
{
    Cy_SysTick_Clear();
}

/*******************************************************************************
* Function Name: StopRuntimeMeasurement
********************************************************************************
* Summary:
*  Reads the system tick and converts to time in microseconds(us).
*
*  Returns:
*  runTime - in microseconds(us)
*******************************************************************************/

static uint32_t StopRuntimeMeasurement()
{
    uint32_t ticks;
    uint32_t runTime;
    ticks = Cy_SysTick_GetValue();
    ticks = (SYS_TICK_MAX_INTERVAL - Cy_SysTick_GetValue());
    runTime = (ticks * TIME_PER_TICK_IN_US);
    return runTime;
}
#endif

#if ENABLE_SPI_SERIAL_LED
/*******************************************************************************
* Function Name: UpdateLeds
********************************************************************************
* Summary:
*  Control LEDs in the kit to show the proximity, touch and liquid active status:
*   No Proximity/Touch : LED1 & LED2 = OFF
*   Proximity          : LED1 = GREEN (with brightness proportional to target 
*                        object distance)
*   Touch              : LED1 = BLUE
*******************************************************************************/
void UpdateLeds(void)
{
    /* Brightness of each LED is represented by 0 to 255,
    * where 0 indicates LED in OFF state and 255 indicate maximum
    * brightness of an LED
    */
    uint8_t proxLedBrightness = 0u;
    uint16_t proxMaxRawCount = 0u;
    uint16_t maxDiffCount = 0u;

    uint32_t proxSensorStatus = Cy_CapSense_IsProximitySensorActive(CY_CAPSENSE_PROXIMITY0_WDGT_ID, CY_CAPSENSE_PROXIMITY0_SNS0_ID, &cy_capsense_context);

    // /* Initialize LED values */
    ledContext.serialLedData[LED1].green = 0u;
    ledContext.serialLedData[LED1].blue = 0u;

    /* LED1 and LED2 Control: Check the status of Active mode sensors (proximity sensor) and control LED1 and LED2 accordingly */

        if(proxSensorStatus == PROX_STATE)
        {
            /* Calculate proximity status LED brightness based on target object/hand distance from sensor */
            proxMaxRawCount = cy_capsense_tuner.widgetContext[CY_CAPSENSE_PROXIMITY0_WDGT_ID].maxRawCount;
            maxDiffCount = proxMaxRawCount - cy_capsense_tuner.sensorContext[CY_CAPSENSE_PROXIMITY0_SNS0_ID].bsln;
            proxLedBrightness = (uint8_t)((uint32_t)(cy_capsense_tuner.sensorContext[CY_CAPSENSE_PROXIMITY0_SNS0_ID].diff*255)/maxDiffCount);

            /* LED1 (GREEN) Turns on when proximity is detected */
            ledContext.serialLedData[LED1].green = proxLedBrightness;
        }
        else if(proxSensorStatus >= TOUCH_STATE)
        {
            /* LED1 (GREEN) Turns on when proximity is detected */
            ledContext.serialLedData[LED1].green = 0;

            /* LED2 (BLUE) Turns on when touch is detected */
            ledContext.serialLedData[LED1].blue = SERIAL_LED_BRIGHTNESS_MAX;
        }

    ProcessSerialLed(&ledContext);
}
#endif

/* [] END OF FILE */
